{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder for future backend functionality.",
  "feature_evidence.json": "Feature evidence report documenting implementation of 2026 design trends including vibrant gradients, glassmorphism effects, scroll animations, and modern typography across frontend components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose, components, and styling implementations.",
  "frontend/index.css": "Tailwind base styles with CSS custom properties defining OKLCH color tokens for light and dark modes, including sidebar, chart, and UI element color variables.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tags and root div mounting point.",
  "frontend/src/App.tsx": "Main application component composing the landing page with Hero, FeaturesOverview, MobileAccessSection, ComplianceSection, and Footer components.",
  "frontend/src/components/ComplianceSection.tsx": "Compliance section with scroll-triggered animations, glassmorphic cards for tax filing and security features, interactive hover effects, and animated certification badges.",
  "frontend/src/components/FeatureCard.tsx": "Reusable glassmorphic feature card component with enhanced hover effects including scale transforms, glow shadows, animated gradient borders, and optional category badges.",
  "frontend/src/components/FeaturesOverview.tsx": "Features section displaying 8 feature cards in a grid with scroll-triggered header animation, staggered card entrance effects, and animated CTA buttons.",
  "frontend/src/components/Footer.tsx": "Footer component with company info, navigation links (Product, Company, Support), social media icons, and UTM tracking for external links. Includes decorative gradient backgrounds and glassmorphism styling.",
  "frontend/src/components/Hero.tsx": "Hero section component featuring animated gradient backgrounds, headline with \"Payroll Made Simple & Secure\", CTA buttons (Get Started Free, Watch Demo), and trust indicators with glassmorphism effects.",
  "frontend/src/components/MobileAccessSection.tsx": "Section showcasing mobile-first payroll access across devices (smartphone, tablet, desktop) with scroll animations and glassmorphism cards highlighting platform features.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, handling authenticated and anonymous states based on Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future React Query hooks when backend functionality is implemented.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to trigger animations when elements scroll into view, with configurable threshold, root margin, and single/repeated trigger options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes featuring vibrant purple-blue primary and cyan accent colors, plus glassmorphism utilities and gradient patterns.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using oklch color space, typography settings with Inter font family, extended font sizes for display text, custom border radius values, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a modern redesign of ableinternetpayroll.com with 2026 design trends (bold gradients, glassmorphism, smooth animations), tracking existing features including landing page, core payroll features display, mobile access sections, compliance information, and visual theme updates."
}