{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder for future backend functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features including landing page, payroll features display, mobile access, compliance sections, and professional design theme with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component structure, styling, and functionality of the payroll landing page application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining comprehensive design tokens for light and dark modes with professional financial theme variables.",
  "frontend/index.html": "HTML entry point for the React application with basic meta tags and root div mounting point.",
  "frontend/src/App.tsx": "Root React component composing the landing page layout with Hero, FeaturesOverview, MobileAccessSection, ComplianceSection, and Footer components.",
  "frontend/src/components/ComplianceSection.tsx": "Section component displaying two-column grid of compliance features including automated tax filing (W-2s, 1099s, quarterly reports) and enterprise security certifications with icons and detailed feature lists.",
  "frontend/src/components/FeatureCard.tsx": "Reusable card component displaying feature icon/image, category badge, title, description with hover effects and animated bottom border.",
  "frontend/src/components/FeaturesOverview.tsx": "Section component rendering an 8-card grid showcasing core payroll features (employee management, payroll processing, tax filing, direct deposit, time tracking, benefits, reporting, security) with category badges and bottom CTA buttons.",
  "frontend/src/components/Footer.tsx": "Footer component with four-column layout containing company info, product/company/support navigation links, social media icons, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Hero.tsx": "Hero section component with gradient background, headline \"Payroll Made Simple & Secure\", CTA buttons for \"Get Started Free\" and \"Watch Demo\", plus trust indicators and decorative elements.",
  "frontend/src/components/MobileAccessSection.tsx": "Section showcasing multi-platform payroll access with icons and descriptions for mobile apps, desktop, tablet, and cloud-based features, plus a \"Download Mobile App\" CTA button.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor using React Query, switching between authenticated and anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for ICP integration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future React Query hooks when backend functionality is implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark professional financial theme (deep blue primary, teal accent) and utility classes including grid pattern background.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped in QueryClientProvider and InternetIdentityProvider for React Query and ICP authentication support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color system using OKLCH, Inter font family, container settings, custom shadows, and accordion animations with typography and animate plugins.",
  "project_state.json": "Project configuration for a modern redesign of ableinternetpayroll.com, a payroll management platform demo/prototype. Defines five existing features covering landing page, core payroll functionality display, mobile access, compliance/security sections, and professional visual design with trustworthy financial service aesthetics."
}