{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder for future backend functionality.",
  "feature_evidence.json": "Feature evidence report documenting two design-related features: creating an alternative design version (Version 3) and implementing a cohesive modern visual theme different from gradient/glassmorphism aesthetics.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing a clean corporate design system with navy/orange colors, sharp borders, geometric elements, and professional styling without gradients or glassmorphism.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color tokens for light and dark modes with minimal, professional design variables for backgrounds, foregrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Able Internet Payroll Revamp', and script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component composing the landing page with Hero, FeaturesOverview, MobileAccessSection, ComplianceSection, and Footer components in a single-page layout.",
  "frontend/src/components/ComplianceSection.tsx": "Compliance section component featuring security/compliance content with clean cards, accent borders, animated scroll effects, tax filing features, and certification badges using Shield, FileCheck, Lock, Award, and CheckCircle2 icons.",
  "frontend/src/components/FeatureCard.tsx": "Reusable feature card component with clean styling, sharp borders, geometric icon containers, optional category badge, and hover effects for lift and border color changes.",
  "frontend/src/components/FeaturesOverview.tsx": "Features section displaying 8 payroll feature cards (employee management, automated payroll, tax filing, time tracking, compliance, reporting, mobile access, integrations) in a responsive grid with scroll animations and CTA button.",
  "frontend/src/components/Footer.tsx": "Professional footer component with company info, social media icons (Facebook, X, LinkedIn, Instagram), organized link sections, and required caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/Hero.tsx": "Hero section component with headline, CTA buttons, trust badges, and decorative geometric background elements using Tailwind styling and Lucide icons.",
  "frontend/src/components/MobileAccessSection.tsx": "Marketing section showcasing multi-platform payroll access with animated content cards for mobile, desktop, tablet, and cloud features using scroll animations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future React Query hooks when backend functionality is implemented.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to trigger visibility state changes for scroll-based animations with configurable threshold and trigger options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom corporate theme colors (navy, orange accent) for light/dark modes, grid patterns, card utilities, and animation keyframes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color system with OKLCH values, typography scales, display font sizes, shadows, and extended theme utilities for the corporate design system.",
  "project_state.json": "Project state tracking for a modern redesign of ableinternetpayroll.com, featuring 2026 design trends (gradients, glassmorphism, animations) applied to a payroll management platform. Tracks 8 existing features including landing page, core payroll features display, mobile access, compliance sections, and modern visual treatments with scroll-triggered animations."
}